# University Of Twente Databases

They have a few intersting tables.
1. All Databases
[UTwente All Satellites](https://webapps.itc.utwente.nl/sensor/default.aspx?view=allsatellites)

2. All Sensors Databases

Not sure how we will use the sensors database but might be useful, only scrapped the all satellites.

In [1]:
# Import necessary packages
from bs4 import BeautifulSoup
import requests
import pandas as pd
import re

# Site URL
url="https://webapps.itc.utwente.nl/sensor/default.aspx?view=allsatellites"

In [2]:
# Make a GET request to fetch the raw HTML content
html_content = requests.get(url).text

# Parse HTML code for the entire site
soup = BeautifulSoup(html_content, "lxml")

In [4]:
# On site there are 3 tables with the class "wikitable"
# The following line will generate a list of HTML content for each table
gdp = soup.find_all("table", attrs={"class": "sdbtable"})
print("Number of tables on site: ",len(gdp))

Number of tables on site:  1

In [5]:
# Lets go ahead and scrape first table with HTML code gdp[0]
table1 = gdp[0]
# the head will form our column names
body = table1.find_all("tr")
# Head values (Column names) are the first items of the body list
head = body[0] # 0th item is the header row
body_rows = body[1:] # All other items becomes the rest of the rows

# Lets now iterate through the head HTML code and make list of clean headings

# Declare empty list to keep Columns names
headings = []
for item in head.find_all("th"): # loop through all th elements
    # convert the th elements to text and strip "\n"
    item = (item.text).rstrip("\n")
    # append the clean column name to headings
    headings.append(item)
print(headings)

['Name', 'Orbit Type', 'Orbit Height (km)', 'Repeat Cycle (days)', 'Launched in', 'Out of service since', 'Organisation']

In [6]:
# Next is now to loop though the rest of the rows

#print(body_rows[0])
all_rows = [] # will be a list for list for all rows
for row_num in range(len(body_rows)): # A row at a time
    row = [] # this will old entries for one row
    for row_item in body_rows[row_num].find_all("td"): #loop through all row entries
        # row_item.text removes the tags from the entries
        # the following regex is to remove \xa0 and \n and comma from row_item.text
        # xa0 encodes the flag, \n is the newline and comma separates thousands in numbers
        aa = re.sub("(\xa0)|(\n)|,","",row_item.text)
        #append aa to row - note one row entry is being appended
        row.append(aa)
    # append one row to all_rows
    all_rows.append(row)

In [7]:
# We can now use the data on all_rowsa and headings to make a table
# all_rows becomes our data and headings the column names
df = pd.DataFrame(data=all_rows,columns=headings)
df.head()

,Name,Orbit Type,Orbit Height (km),Repeat Cycle (days),Launched in,Out of service since,Organisation
0,\r ADEOS\r ...,Sun Synchronous,797,41,1996,1997,JAXA - Japan
1,\r ADEOS-II\r ...,Sun Synchronous,803,4,2002,2003,JAXA - Japan
2,\r Aeolus\r ...,Sun Synchronous,320,7,2018,,ESA
3,\r ALMAZ-1\r ...,Non Sun Synchronous,370,,1991,1992,NPO - Mashinostroyeniya
4,\r ALOS\r ...,Sun Synchronous,702,46,2006,2011,JAXA - Japan